#### CanExecuteEventArgs Members

---

|  |
| --- |
| CanExecuteEventArgs Class   Methods   Properties   See Also |

The  CanExecuteEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetSelectedCategoryIds | Gets the category ids of selected elements. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ActiveDocument | The active document. (Inherited from  CommandEventArgs  .) |
| Public property | Cancel | Indicates whether the event is being cancelled. When the event is cancellable, set the property to True to cancel it. (Inherited from  RevitEventArgs  .) |
| Public property | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from  RevitEventArgs  .) |
| Public property | CanExecute | The value that indicates whether the Command associated with this event can be executed. |
| Public property | CommandId | The command id. (Inherited from  CommandEventArgs  .) |
| Public property | IsChecked | The value that indicates whether the UI associated with the Command associated with this event is in a checked state. |

# See Also

CanExecuteEventArgs Class

Autodesk.Revit.UI.Events Namespace